create_clock -name clk -period 8 [get_ports clk_i]

set_clock_uncertainty -setup 0.5 [get_clocks clk]
set_clock_uncertainty -hold 0.2 [get_clocks clk]

set_input_delay 2.0 -clock clk [all_inputs]
set_input_delay 0.5 -clock clk -min [all_inputs]

set_output_delay 2.0 -clock clk [all_outputs]
set_output_delay 0.5 -clock clk -min [all_outputs]

